# Користувач вводить текст
input_string = input("Введіть текст: ")

# Користувач вводить слово для пошуку
search_word = input("Введіть слово для пошуку: ")

# Користувач вводить слово для заміни
replace_word = input("На яке слова замінити?: ")

# Розділяємо введений рядок на список слів
words = input_string.split()

# Ініціалізуємо результат як порожній рядок
result = ""

# Перевіряємо кожне слово у списку
for word in words:
    # Перевіряємо, чи поточне слово відповідає слову для пошуку
    if word == search_word:
        result += replace_word + " "  # Замінюємо слово
    else:
        result += word + " "  # Залишаємо незмінні слова

# Виводимо результат
print("Змінений рядок:", result.strip())